content-org/emacsforall.org
#+hugo_base_dir: ../
#+hugo_section: posts

#+hugo_auto_set_lastmod: t

#+author: Jonathan Chu

** DONE The 10 Packages Every New Emacs User Should Install :emacs:packages:beginners:
:PROPERTIES:
:EXPORT_FILE_NAME: 10-packages-every-new-emacs-user-should-install
:EXPORT_DATE: 2026-02-08
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :series ["Getting Started with Emacs"]
:END:

The Emacs package ecosystem is vast — MELPA alone has over 5,000 packages. That's exciting but also overwhelming. Here are the 10 packages that give you the most value for the least configuration.

#+begin_export hugo
{{< youtube dQw4w9WxXcQ >}}
#+end_export

*** 1. Vertico

Modern, minimal vertical completion UI. Replaces the default minibuffer completion with something you'd actually want to use.

#+begin_src emacs-lisp
(use-package vertico
  :ensure t
  :init (vertico-mode))
#+end_src

*** 2. Consult

Search and navigation commands that integrate with Vertico. =consult-ripgrep=, =consult-line=, and =consult-buffer= will change how you navigate code.

#+begin_src emacs-lisp
(use-package consult
  :ensure t
  :bind (("C-s" . consult-line)
         ("C-x b" . consult-buffer)
         ("M-g g" . consult-goto-line)))
#+end_src

*** 3. Marginalia

Adds helpful annotations next to completion candidates — file sizes, docstrings, keybindings.

#+begin_src emacs-lisp
(use-package marginalia
  :ensure t
  :init (marginalia-mode))
#+end_src

*** 4. Orderless

Flexible completion matching. Type any part of what you're looking for in any order.

#+begin_src emacs-lisp
(use-package orderless
  :ensure t
  :custom (completion-styles '(orderless basic)))
#+end_src

*** 5. Magit

The best Git interface ever made. Not an exaggeration. Once you use Magit, you'll never want to go back to the command line for Git.

#+begin_src emacs-lisp
(use-package magit
  :ensure t
  :bind ("C-x g" . magit-status))
#+end_src

*** 6. Org-mode

Technically built-in, but worth mentioning because it's often why people come to Emacs in the first place. Notes, tasks, literate programming, and more.

*** 7. Which-key

Shows available keybindings in a popup. Essential for discoverability when you're learning.

#+begin_src emacs-lisp
(use-package which-key
  :ensure t
  :init (which-key-mode))
#+end_src

*** 8. Corfu

In-buffer completion popup. Fast, minimal, works with Eglot's LSP completions out of the box.

#+begin_src emacs-lisp
(use-package corfu
  :ensure t
  :init (global-corfu-mode))
#+end_src

*** 9. Eglot

Built-in LSP client (since Emacs 29). Minimal configuration, just install a language server and go.

#+begin_src emacs-lisp
;; Eglot is built-in, just hook it up
(add-hook 'python-mode-hook #'eglot-ensure)
(add-hook 'js-mode-hook #'eglot-ensure)
(add-hook 'rust-mode-hook #'eglot-ensure)
#+end_src

*** 10. Doom Themes

Even if you don't use Doom Emacs, the theme collection is excellent. =doom-one= and =doom-gruvbox= are crowd favorites.

#+begin_src emacs-lisp
(use-package doom-themes
  :ensure t
  :config
  (load-theme 'doom-one t))
#+end_src

*** Putting It All Together

All of these packages work together harmoniously. Vertico + Consult + Marginalia + Orderless form a completion framework that rivals anything in VS Code, and Magit + Org-mode are the power tools that keep experienced users on Emacs for decades.
